<a href="https://colab.research.google.com/github/darshan-jain/19CSE304-FDS/blob/main/fds_quiz.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [3]:
arr=[7, 9, 13, 4, 18, 3, 9, 10, 15, 8, 2, 6, 9]
df = pd.DataFrame(arr, columns =['A'])
df

     A
0    7
1    9
2   13
3    4
4   18
5    3
6    9
7   10
8   15
9    8
10   2
11   6
12   9

In [5]:
df.describe()

               A
count  13.000000
mean    8.692308
std     4.625736
min     2.000000
25%     6.000000
50%     9.000000
75%    10.000000
max    18.000000

In [7]:
data = pd.read_csv("https://raw.githubusercontent.com/DeepikaTG/Dataset/main/CGM.csv")
data.describe()

            glucose
count  52281.000000
mean     137.421912
std       53.880476
min       40.000000
25%       99.000000
50%      126.000000
75%      163.000000
max      400.000000

In [8]:
dff = pd.read_csv("https://raw.githubusercontent.com/DeepikaTG/Dataset/main/CGM.csv")

In [9]:
dff.head()

    isig             datetime  glucose
0  22.59  2010-03-24 09:51:00      258
1  22.52  2010-03-24 09:56:00      260
2  22.23  2010-03-24 10:01:00      258
3  21.56  2010-03-24 10:06:00      254
4  20.79  2010-03-24 10:11:00      246

In [11]:
dff['glucose'].skew()

1.2658695452686366

In [12]:
dff['glucose'].kurt()

1.9172821560197844

In [13]:
dff.describe()

            glucose
count  52281.000000
mean     137.421912
std       53.880476
min       40.000000
25%       99.000000
50%      126.000000
75%      163.000000
max      400.000000